{
    "stories": [
        {
            "wave": 1,
            "text": "Klingon warships detected crossing the Neutral Zone. They've locked disruptors on our position!"
        },
        {
            "wave": 2,
            "text": "The Klingon High Council has sent reinforcements. Today is a good day to die... for them."
        },
        {
            "wave": 3,
            "text": "A wing of Birds-of-Prey decloaks off the port bow in attack formation. Shields up!"
        },
        {
            "wave": 4,
            "text": "Romulan Warbirds shimmer out of cloak alongside the Klingons. An unholy alliance has formed."
        },
        {
            "wave": 5,
            "text": "The simulation intensifies. Senator! The Federation cadet refuses to surrender the Kobayashi Maru."
        },
        {
            "wave": 6,
            "text": "The Tal Shiar commands this operation now. Prepare for precision strikes, cadet."
        },
        {
            "wave": 7,
            "text": "A transwarp conduit opens. We are the Borg. Your technological distinctiveness will be added to our own."
        },
        {
            "wave": 8,
            "text": "Resistance is futile. The Collective adapts... but so do we. Modulating phaser frequencies!"
        },
        {
            "wave": 9,
            "text": "Sensors overloading! This isn't a no-win scenario anymore. It's a massacre in the making."
        },
        {
            "wave": 10,
            "text": "Species 8472 emerges from fluidic space. Even the Borg fear them. There is no retreat, cadet."
        },
        {
            "wave": 11,
            "text": "Long-range sensors detect another armada approaching. The simulation shows no mercy."
        },
        {
            "wave": 12,
            "text": "Admiral, recommend we recalibrate the holodeck safeties. This is getting out of hand!"
        },
        {
            "wave": 13,
            "text": "The enemy fleet has adapted to our tactics. Starfleet Academy didn't prepare us for this."
        },
        {
            "wave": 14,
            "text": "Subspace distortions everywhere! They're coming from all directions now."
        },
        {
            "wave": 15,
            "text": "Captain's log: We have exceeded all survival projections. Still the enemy comes."
        },
        {
            "wave": 16,
            "text": "The Kobayashi Maru sends a final distress call. We will not abandon those 300 souls."
        },
        {
            "wave": 17,
            "text": "EPS conduits are overloading. Structural integrity at 47%. We stand our ground."
        },
        {
            "wave": 18,
            "text": "Make it so, cadet. Every second we survive defies the impossible."
        },
        {
            "wave": 19,
            "text": "They underestimated Starfleet's resolve. Q'apla! Victory through persistence!"
        },
        {
            "wave": 20,
            "text": "The fleets multiply. This simulation was never meant to be beaten."
        },
        {
            "wave": 21,
            "text": "Incoming transmission from Starfleet Command: 'Hold the line. Reinforcements are... unavailable.'"
        },
        {
            "wave": 22,
            "text": "The Tholians weave their crystalline web around the sector. Escape routes are closing."
        },
        {
            "wave": 23,
            "text": "Warp core temperature critical. We're running on auxiliary power and pure determination."
        },
        {
            "wave": 24,
            "text": "The Dominion sends their regards. Jem'Hadar attack ships decloak on all vectors!"
        },
        {
            "wave": 25,
            "text": "Ketracel-white supplies detected in the enemy fleet. They won't stop until we're destroyed."
        },
        {
            "wave": 26,
            "text": "The Founders have taken an interest in this simulation. Shapeshifters among the crew?"
        },
        {
            "wave": 27,
            "text": "Cardassian Galor-class cruisers join the assault. The Obsidian Order wants answers."
        },
        {
            "wave": 28,
            "text": "Gul Dukat's voice crackles over comms: 'Your Federation ideals end here, cadet.'"
        },
        {
            "wave": 29,
            "text": "A temporal anomaly! Ships from multiple eras converge on our position."
        },
        {
            "wave": 30,
            "text": "The Department of Temporal Investigations won't be happy about this timeline."
        },
        {
            "wave": 31,
            "text": "Chroniton particles detected. Past and future enemies attack simultaneously."
        },
        {
            "wave": 32,
            "text": "Q appears on the bridge: 'Fascinating! I didn't think you'd last this long, mon capitaine.'"
        },
        {
            "wave": 33,
            "text": "The Crystalline Entity approaches. Its beautiful song masks deadly intent."
        },
        {
            "wave": 34,
            "text": "Nanoprobes detected in the atmospheric system. The Borg are attempting assimilation."
        },
        {
            "wave": 35,
            "text": "Seven of Nine: 'Their tactical patterns are inefficient. We will adapt faster.'"
        },
        {
            "wave": 36,
            "text": "Data calculates our survival probability at 0.0047%. He finds this 'intriguing.'"
        },
        {
            "wave": 37,
            "text": "Picard's voice echoes: 'The line must be drawn HERE. This far, no further!'"
        },
        {
            "wave": 38,
            "text": "Sisko channels the Prophets. The wormhole aliens whisper of linear time's end."
        },
        {
            "wave": 39,
            "text": "Janeway's log: 'Coffee. Black. And keep those quantum torpedoes coming.'"
        },
        {
            "wave": 40,
            "text": "Kirk's ghost haunts the bridge: 'I don't believe in the no-win scenario, remember?'"
        },
        {
            "wave": 41,
            "text": "Spock raises an eyebrow: 'The needs of the Kobayashi Maru outweigh the needs of the few.'"
        },
        {
            "wave": 42,
            "text": "McCoy: 'I'm a doctor, not a miracle worker! Wait, we need a miracle worker!'"
        },
        {
            "wave": 43,
            "text": "Scotty beams up from beyond: 'She cannae take much more of this, Captain!'"
        },
        {
            "wave": 44,
            "text": "The Nexus ribbon appears. Temptation whispers of an existence without suffering."
        },
        {
            "wave": 45,
            "text": "Mirror universe ships phase through. In their world, the Kobayashi Maru fights back."
        },
        {
            "wave": 46,
            "text": "Tribbles infest the enemy fleet! Even the Borg seem confused by the fuzzy menace."
        },
        {
            "wave": 47,
            "text": "The Whale Probe returns. Its song disrupts all communications. Humpbacks, anyone?"
        },
        {
            "wave": 48,
            "text": "V'Ger seeks its Creator. It finds only a stubborn cadet refusing to stand down."
        },
        {
            "wave": 49,
            "text": "Praxis explodes again in this timeline. Klingon moon debris adds to the chaos."
        },
        {
            "wave": 50,
            "text": "You've reached the final simulation level. The computer itself marvels at your tenacity."
        }
    ]
}